vipci/app/Models/UserModel.php

    public function AuthenticateUser($username, $password)
    {

        $user = $this->where(["login_name" => $username])->first();
---
SELECT *
FROM `users`
WHERE `login_name` = 'admin@vipcourier.com'
 LIMIT 1