app/Models/ConsignmentsModel.php

SELECT *
FROM `consignments`
WHERE `internal_lrn` = '809909'
 LIMIT 1
---
    private function translate_lrn($internal_lrn, $provider)
    {
        $lrn = $this->where("internal_lrn", $internal_lrn)->first();